# 1.2 По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b, проходящей через эти
# точки.

x1 = float(input("Координата X для первой точки"))
y1 = float(input("Координата X для первой точки"))
х2 = float(input("Координата X для второй точки"))
y2 = float(input("Координата Y для второй точки"))

k = (y1 - y2) / (x1 - х2)
b = y1 - k * x1
# point1 = [float(el) for el in input("Координаты первой точки через запятую: ").split(',')]
# point2 = [float(el) for el in input("Координаты второй точки через запятую: ").split(',')]
#
# k = (point1[1] - point2[1]) / (point1[0] - point2[0])
# b = point2[1] - k * point2[0]

print(f"Линейное уравнение: y = {k} * x + {b}")